jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
        return fileInfo->file;
    }
    SettingFile getValueVector(const char* name, std::vector<int> &value)
    {
        SettingFileInfo* fileInfo = getFile(name);
        if(!fileInfo) 
        {
            LogHandler::error("getValueVector Key not found in settings: %s", name);
            return SettingFile::NONE;
        }
        if(!fileInfo->initialized) 
        {
            LogHandler::error(m_TAG, "getValueVector int called before initialized");
            return SettingFile::NONE;
        }
        //const Setting* setting = fileInfo->getSetting(name);
        JsonArray array = fileInfo->doc[name].as<JsonArray>();
        for (size_t i = 0; i < array.size(); i++)
        {
            value.push_back(array[i].as<int>());
        }
        
        return fileInfo->file;
    }
    
    PinMap* getPins() 
    {
        return m_currentPinMap;
    }

    template<typename T,
             typename = std::enable_if<std::is_integral<T>::value || std::is_floating_point<T>::value || std::is_same<T, bool>::value>>
    SettingFile setValue(const char* name, const T &value, bool writeToDisk = false) 
    {

        SettingFileInfo* fileInfo = getFile(name);
        if(!fileInfo) 
        {
            LogHandler::error(m_TAG, "setValue T key not found");
            return SettingFile::NONE;
        }
        if(!fileInfo->initialized) 
        {
            LogHandler::error(m_TAG, "setValue T called before initialized");
            return SettingFile::NONE;
        }
        T currentValue = fileInfo->doc[name].as<T>();
        if(fileInfo->doc[name].isNull() || currentValue != value) {
            fileInfo->doc[name] = value;
            if(writeToDisk && !saveToDisk(*fileInfo)) 
            {
                return SettingFile::NONE;
            }
            checkRestartRequired(fileInfo, name);
            if(fileInfo->onchange)
                fileInfo->onchange(name);
            // if(fileInfo->file == SettingFile::System) 
            // {
            //     loadSystemLiveCache(name);
            // } 
            // else if(fileInfo->file == SettingFile::Common) 
            // {
            //     loadCommonLiveCache(name);
            // }
        }
        return fileInfo->file;
        // if (m_systemFileInfo.initialized && m_systemFileInfo.doc[name].is<T>())
        // {
        //     if(!m_systemFileInfo.initialized) 
        //     {
        //         LogHandler::error(m_TAG, "setValue T called before system file initialized");
        //         return SettingFile::NONE;
        //     }
        //     T currentValue = m_systemFileInfo.doc[name].as<T>();
        //     if(currentValue != value) 
        //     {
        //         LogHandler::debug(m_TAG, "Change system value T: %s", name);
        //         m_systemFileInfo.take();
        //         checkRestartRequired(&m_systemFileInfo, name);
        //         m_systemFileInfo.doc[name] = value;
        //         loadSystemLiveCache(name);
        //         m_systemFileInfo.give();
        //     }
        //     if(writeToDisk && !saveToDisk(m_systemFileInfo)) 
        //     {
        //         return SettingFile::NONE;
        //     }
        //     return SettingFile::System;
        // }
        // else if (m_networkFileInfo.initialized && m_networkFileInfo.doc[name].is<T>())
        // {
        //     if(!m_networkFileInfo.initialized) 
        //     {
        //         LogHandler::error(m_TAG, "setValue T called before network file initialized");
        //         return SettingFile::NONE;
        //     }
        //     T currentValue = m_networkFileInfo.doc[name].as<T>();
        //     if(currentValue != value) 
        //     {
        //         LogHandler::debug(m_TAG, "Change wifi value T: %s", name);
        //         m_networkFileInfo.take();
        //         checkRestartRequired(&m_networkFileInfo, name);
        //         m_networkFileInfo.doc[name] = value;
        //         loadNetworkLiveCache(name);
        //         m_networkFileInfo.give();
        //     }
        //     if(writeToDisk && !saveToDisk(m_networkFileInfo)) 
        //     {
        //         return SettingFile::NONE;
        //     }
        //     return SettingFile::Network;
        // }
        // else if (m_commonFileInfo.initialized && m_commonFileInfo.doc[name].is<T>())
        // {
        //     if(!m_commonFileInfo.initialized) 
        //     {
        //         LogHandler::error(m_TAG, "setValue T called before common file initialized");
        //         return SettingFile::NONE;
        //     }
        //     T currentValue = m_commonFileInfo.doc[name].as<T>();
        //     if(currentValue != value) 
        //     {
        //         LogHandler::debug(m_TAG, "Change common value T: %s", name);
        //         m_commonFileInfo.take();
        //         checkRestartRequired(&m_commonFileInfo, name);
        //         m_commonFileInfo.doc[name] = value;
        //         loadCommonLiveCache(name);
        //         m_commonFileInfo.give();
        //     }
        //     if(writeToDisk && !saveToDisk(m_commonFileInfo)) 
        //     {
        //         return SettingFile::NONE;
        //     }
        //     return SettingFile::Common;
        // }
        // else if (m_pinsFileInfo.initialized && m_pinsFileInfo.doc[name].is<T>())
        // {
        //     if(!m_pinsFileInfo.initialized) 
        //     {
        //         LogHandler::error(m_TAG, "setValue T called before pins file initialized");
        //         return SettingFile::NONE;
        //     }
        //     T currentValue = m_pinsFileInfo.doc[name].as<T>();
        //     if(currentValue != value) 
        //     {
        //         LogHandler::debug(m_TAG, "Change pin value T: %s", name);
        //         m_pinsFileInfo.take();
        //         checkRestartRequired(&m_pinsFileInfo, name);
        //         m_pinsFileInfo.doc[name] = value;
        //         loadPinLiveCache();
        //         m_pinsFileInfo.give();
        //     }
        //     if(writeToDisk && !saveToDisk(m_pinsFileInfo)) 
        //     {
        //         return SettingFile::NONE;
        //     }
        //     return SettingFile::Pins;
        // }
        // LogHandler::error(m_TAG, "setValue T key not found: %s", name);
        // return SettingFile::NONE;
    }

