jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
    SettingFile setValue(const char* name, const char* value, bool writeToDisk = false) 
    {
        SettingFileInfo* fileInfo = getFile(name);
        if(!fileInfo) 
        {
            LogHandler::error(m_TAG, "setValue const char* key not found");
            return SettingFile::NONE;
        }
        if(!fileInfo->initialized) 
        {
            LogHandler::error(m_TAG, "setValue const char* called before initialized");
            return SettingFile::NONE;
        }
        const char* currentValue = fileInfo->doc[name].as<const char*>();
        if(fileInfo->doc[name].isNull() || strcmp(currentValue, value)) {
            LogHandler::debug(m_TAG, "Change value: %s old value: %s new value: %s", name, currentValue, strcmp(name, AP_MODE_PASS) || strcmp(name, WIFI_PASS_SETTING) || !strcmp(value, WIFI_PASS_DONOTCHANGE_DEFAULT) ? value : "<Redacted>");
            fileInfo->doc[name] = value;
            if(writeToDisk && !saveToDisk(*fileInfo)) 
            {
                return SettingFile::NONE;
            }
            checkRestartRequired(fileInfo, name);
            if(fileInfo->onchange)
                fileInfo->onchange(name);
            // if(fileInfo->file == SettingFile::System) 
            // {
            //     loadSystemLiveCache(name);
            // } 
            // else if(fileInfo->file == SettingFile::Common) 
            // {
            //     loadCommonLiveCache(name);
            // }
        }
        return fileInfo->file;
    }

    template <typename T>
    SettingFile setValue(const char* name, const std::vector<T> &value, bool writeToDisk = false) 
    {
        LogHandler::debug(m_TAG, "Set vector value: %s", name);
        SettingFileInfo* fileInfo = getFile(name);
        if(!fileInfo->initialized) 
        {
            LogHandler::error(m_TAG, "setValue vector T called before initialized");
            return SettingFile::NONE;
        }
        if(!fileInfo) 
        {
            LogHandler::error(m_TAG, "setValue vector T Set value key not found");
            return SettingFile::NONE;
        }
        fileInfo->doc[name] = value;
        if(writeToDisk && !saveToDisk(*fileInfo)) 
        {
            return SettingFile::NONE;
        }
        checkRestartRequired(fileInfo, name);
        if(fileInfo->file == SettingFile::System) 
        {
            loadSystemLiveCache(name);
        } 
        else if(fileInfo->file == SettingFile::Common) 
        {
            loadCommonLiveCache(name);
        }
        return fileInfo->file;
    }

    void defaultValue(const char* name) 
    {
        LogHandler::debug(m_TAG, "Default: %s", name);
        SettingFileInfo* fileInfo = getFile(name);
        if(!fileInfo->initialized) 
        {
            LogHandler::error(m_TAG, "defaultValue called before initialized");
            return;
        }
        if(!fileInfo) 
        {
            LogHandler::error(m_TAG, "defaultValue key not found: %s", name);
            return;
        }
        const Setting* setting = fileInfo->getSetting(name);
        checkRestartRequired(setting, name);
        defaultToJson(setting, fileInfo->doc);
        if(fileInfo->file == SettingFile::System) 
        {
            loadSystemLiveCache(name);
        } 
        else if(fileInfo->file == SettingFile::Common) 
        {
            loadCommonLiveCache(name);
        }
        switch(fileInfo->file)
        {
            case SettingFile::Network:
            saveNetwork();
            break;
            case SettingFile::Common:
            saveCommon();
            break;
            case SettingFile::Pins:
            savePins();
            break;
            case SettingFile::ButtonSet:
            //saveButtonSet();
            break;
            case SettingFile::MotionProfile:
            //saveMotionProfiles();
            break;
            default:
                LogHandler::error(m_TAG, "defaultValue key not found: %s", name);
            break;
        }
    }

    bool saveAllToDisk(JsonObject fromJson = JsonObject())
    {
        for(SettingFileInfo* settingsInfo : AllSettings)
        {
            if(!saveToDisk(*settingsInfo, fromJson))
                return false;
        }
        // loadCommonLiveCache();
        // loadPinCache();
        return true;;
    }
    bool resetAll() 
    {
        for(SettingFileInfo* settingsInfo : AllSettings)
        {
            if(!deleteJsonFile(settingsInfo->path))
                return false;
        }
        if(!deleteJsonFile(MOTION_PROFILE_SETTINGS_PATH))
            return false;
        if(!deleteJsonFile(BUTTON_SETTINGS_PATH))
            return false;
        if(!deleteJsonFile(CHANNELS_SETTINGS_PATH))
            return false;
        // for(SettingFileInfo* settingsInfo : AllSettings)
        // {
        //     if(!loadDefault(*settingsInfo))
        //         return false;
        // }
        return true;
    }

    bool save(SettingFile file, JsonObject fromJson = JsonObject()) {
        switch(file)
        {
            case SettingFile::Common:
                if(!saveCommon(fromJson)) {
                    return false;
                }
                break;
            case SettingFile::Network:
                if(!saveNetwork(fromJson)) {
                    return false;
                }
            case SettingFile::Pins:
                if(!savePins(fromJson)) {
                    return false;
                }
                break;
            default: {
                LogHandler::error(m_TAG, "Invalid or unsuported file: %ld", (int)file);
                return false;
            }
        }
        return true;
    }

    bool saveSystem(JsonObject fromJson = JsonObject())
    {
        m_systemFileInfo.take();
        bool ret = saveToDisk(m_systemFileInfo, fromJson);
        m_systemFileInfo.give();
        if(ret) {
            loadSystemLiveCache();
        }
        return ret;
    }
    bool resetSystem()
    {
        m_systemFileInfo.take();
        bool ret = loadDefault(m_systemFileInfo);
        m_systemFileInfo.give();
        if(ret)
            loadSystemLiveCache();
        return ret;
    }
    bool saveCommon(JsonObject fromJson = JsonObject())
    {
        m_commonFileInfo.take();
        bool ret = saveToDisk(m_commonFileInfo, fromJson);
        m_commonFileInfo.give();
        if(ret) {
            loadCommonLiveCache();
        }
        return ret;
    }
    bool resetCommon()
    {
        m_commonFileInfo.take();
        bool ret = loadDefault(m_commonFileInfo);
        m_commonFileInfo.give();
        if(ret)
            loadCommonLiveCache();
        return ret;
    }

