jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
    bool changeBoardType(int8_t value)
    {
        if(value >= (int8_t)BoardType::MAX || value < 0)
        {
			LogHandler::error(m_TAG, "[changeBoardType] Invalid value: %ld. Valid board types are %s", value, BOARD_TYPES_HELP);
            return false;
        }
        BoardType boardType = (BoardType)value;
        MotorType motorType;
        getValue(MOTOR_TYPE_SETTING, motorType);
        if(motorType == MotorType::BLDC)
        {
            if (boardType == BoardType::CRIMZZON || boardType == BoardType::ISAAC)
            {
                LogHandler::error(m_TAG, "[changeBoardType] Invalid board type for current motor");
                return false;
            }
        }
        if(boardType == BoardType::CRIMZZON || boardType == BoardType::ISAAC) 
        {
            setValue(DEVICE_TYPE, DeviceType::SR6);
        } 
        else if(boardType == BoardType::SSR1PCB) 
        {
            setValue(DEVICE_TYPE, DeviceType::SSR1);
            setValue(BLDC_MOTORA_ENCODER, BLDCEncoderType::MT6701);
        }
        LogHandler::info(m_TAG, "[changeBoardType] Settings pinout default");
        setValue(BOARD_TYPE_SETTING, boardType);
        return saveSystem() && saveCommon() && defaultPinout();
    }

    bool changeDeviceType(int8_t value)
    {
        if(value >= (int8_t)DeviceType::MAX || value < 0)
        {
			LogHandler::error(m_TAG, "[changeDeviceType] Invalid value: %ld. Valid device types are %s", value, DEVICE_TYPES_HELP);
            return false;
        }
        DeviceType newType = (DeviceType)value;
        MotorType motorType;
        getValue(MOTOR_TYPE_SETTING, motorType);
        if(motorType == MotorType::Servo)
        {
            if (newType == DeviceType::SSR1 || newType == DeviceType::SSR2)
            {
                LogHandler::error(m_TAG, "[changeDeviceType] Invalid device type (%ld) for current motor. Valid device types are %s", value, DEVICE_TYPES_HELP);
                return false;
            }
        }
        else if(motorType == MotorType::BLDC)
        {
            if (newType != DeviceType::NONE && newType != DeviceType::SSR1 && newType != DeviceType::SSR2)
            {
                LogHandler::error(m_TAG, "[changeDeviceType] Invalid device type (%ld) for current motor. Valid device types are %s", value, DEVICE_TYPES_HELP);
                return false;
            }
        }
        LogHandler::info(m_TAG, "[changeDeviceType] Settings pinout default");
        setValue(DEVICE_TYPE, newType);
        bool retValue = saveSystem() && saveCommon() && defaultPinout();
        // Override for new device type AFTER default!
        if(motorType == MotorType::BLDC)
        {
            if (newType == DeviceType::SSR2)
            {
                LogHandler::info(m_TAG, "[changeDeviceType] Overriding default settings for SSR2");
                setValue(BLDC_MOTORA_ENCODER, BLDCEncoderType::SPI);
                setValue(BLDC_MOTORB_ENCODER, BLDCEncoderType::SPI);
                setValue(BLDC_MOTORA_VOLTAGE, 12.0f);
                setValue(BLDC_MOTORA_SUPPLY, 12.0f);
                setValue(BLDC_MOTORB_VOLTAGE, 12.0f);
                setValue(BLDC_MOTORB_SUPPLY, 12.0f);
                retValue = saveCommon();
            }
            PinMapSSR* pinMap = PinMapSSR::getInstance();
            pinMap->setDeviceType(newType);
            m_pinsFileInfo.initialized = true;
            syncSSRAndCommonPinsToDisk(pinMap);
            loadDefaultChannelsForDeviceType();
            retValue = saveToDisk(m_pinsFileInfo);
        }
        return retValue;
    }

    bool defaultPinout() {
		//setBoardPinout();
        if(!resetPins())
            return false;
        const PinMap* pinMap = getPins();
        for(int i = 0; i < MAX_BUTTON_SETS; i++) {
            buttonSets[i].pin = pinMap->buttonSetPin(i);
        }
        return savePins();
    }

    bool addLastBootReason(const char* value)
    {
        SettingFileInfo debugInfo = getDebugInfo();
        debugInfo.take();
        if(load(debugInfo))
        {
            JsonArray reasons = debugInfo.doc[DEBUG_INFO_LAST_BOOT_REASONS].as<JsonArray>();
            if(reasons.isNull()) 
            {
                reasons = debugInfo.doc[DEBUG_INFO_LAST_BOOT_REASONS].to<JsonArray>();
            }
            else if(reasons.size() > LAST_BOOT_REASONS_MAX_DEFAULT) 
            {
                reasons.remove(0);
            }
            int index = 1;
            if(reasons.size() > 0)
            {
                JsonObject lastReason = reasons[reasons.size() -1].as<JsonObject>();
                index = lastReason["eventID"].as<int>() + 1;
            }
            JsonObject obj = reasons.add<JsonObject>();
            obj["eventID"] = index;
            obj["reason"] = value;
            if(saveToDisk(debugInfo)) 
            {
                debugInfo.give();
                return true;
            }
        }
        debugInfo.give();

        return false;
    }

    bool resetLastBootReason()
    {
        SettingFileInfo debugInfo = getDebugInfo();
        debugInfo.take();
        if(load(debugInfo))
        {
            debugInfo.doc[DEBUG_INFO_LAST_BOOT_REASONS].to<JsonArray>();
            if(saveToDisk(debugInfo))
            {
                debugInfo.give();
                return true;
            }
        }
        debugInfo.give();
        return false;
    }

    bool addMotorStatus(const char* name, const char* value)
    {
        SettingFileInfo debugInfo = getDebugInfo();
        debugInfo.take();
        if(load(debugInfo))
        {
            JsonArray array = debugInfo.doc[DEBUG_INFO_MOTOR_STATE].as<JsonArray>();
            if(array.isNull()) 
            {
                array = debugInfo.doc[DEBUG_INFO_MOTOR_STATE].to<JsonArray>();
            }
            int index = 1;
            if(array.size() > 0)
            {
                JsonObject lastReason = array[array.size() -1].as<JsonObject>();
                index = lastReason["eventID"].as<int>() + 1;
            }
            JsonObject obj = array.add<JsonObject>();
            obj["eventID"] = index;
            obj["name"] = name;
            obj["message"] = value;
            if(saveToDisk(debugInfo)) 
            {
                debugInfo.give();
                return true;
            }
        }
        debugInfo.give();
        return false;
    }

    bool resetMotorStatus()
    {
        SettingFileInfo debugInfo = getDebugInfo();
        debugInfo.take();
        if(load(debugInfo))
        {
            debugInfo.doc[DEBUG_INFO_MOTOR_STATE].to<JsonArray>();
            if(saveToDisk(debugInfo))
            {
                debugInfo.give();
                return true;
            }
        }
        debugInfo.give();
        return false;
    }
    
