jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
private:
    const char* m_TAG = TagHandler::SettingsFactory;
    PinMap* m_currentPinMap;
    bool m_restartRequired = false;
    bool m_initialized = false;
    // const int m_commonDeserializeSize = 32768;
    // const int m_commonSerializeSize = 24576;

    MotionProfile motionProfiles[MAX_MOTION_PROFILE_COUNT];
    ButtonSet buttonSets[MAX_BUTTON_SETS];

    SettingsChangeCallback message_callback = 0;

    SettingFileInfo m_systemFileInfo = 
    {
        false, SYSTEM_SETTINGS_PATH, SettingFile::System, JsonDocument(), [this] () {loadSystemCache();}, [this](const char* name) { loadSystemLiveCache(name); },
        {
            {LOG_LEVEL_SETTING, "Log level", "The loglevel that will output", SettingType::Number, LOG_LEVEL_DEFAULT, RestartRequired::NO, {SettingProfile::System}},
            {LOG_WEBSOCKET_ENABLED, "Log output to websocket", "If enabled, most logs get sent to the websocket.", SettingType::Boolean, LOG_WEBSOCKET_ENABLED_DEFAULT, RestartRequired::NO, { SettingProfile::System }},
            {DEVICE_TYPE, "Type of device", "The surrent selected device", SettingType::Number, DEVICE_TYPE_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
            {MOTOR_TYPE_SETTING, "Motor type", "The current motor type", SettingType::Number, MOTOR_TYPE_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
            {BOARD_TYPE_SETTING, "Board type", "The physical board type", SettingType::Number, BOARD_TYPE_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
            {TCODE_VERSION_SETTING, "TCode version", "The version of TCode", SettingType::Number, TCODE_VERSION_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
            {LOG_INCLUDETAGS, "Log included tags", "Log tags to be included in the output", SettingType::ArrayString, LOG_INCLUDETAGS_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
            {LOG_EXCLUDETAGS, "Log excluded tags", "Log tags to be excluded in the output", SettingType::ArrayString, LOG_EXCLUDETAGS_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
        }
    };

    SettingFileInfo m_networkFileInfo = 
    {
        false, NETWORK_SETTINGS_PATH, SettingFile::Network, JsonDocument(), [this] () {loadNetworkCache();}, [this] (const char* name) {loadNetworkLiveCache(name);},
        {
            {SSID_SETTING, "Wifi ssid", "The ssid of the WiFi AP", SettingType::String, SSID_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi, SettingProfile::Wireless}},
            {WIFI_PASS_SETTING, "Wifi pass", "The password for the WiFi AP", SettingType::String, WIFI_PASS_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi, SettingProfile::Wireless}},
            {WIFI_BAND_SETTING, "Wifi band", "The band of the wifi", SettingType::Number, WIFI_BAND_SETTING_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi, SettingProfile::Wireless}},
            {STATICIP, "Static IP", "Enable static IP for this device", SettingType::Boolean, STATICIP_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {LOCALIP, "Local IP", "The static IP of this device", SettingType::String, LOCALIP_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {GATEWAY, "Gateway", "The networks gateway", SettingType::String, GATEWAY_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {SUBNET, "Subnet", "The networks subnet", SettingType::String, SUBNET_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {DNS1, "DNS1", "The networks first DNS", SettingType::String, DNS1_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {DNS2, "DSN2", "The networks second DNS", SettingType::String, DNS2_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {MDNS_ENABLED, "Mdns Enabled", "Enable the MDNS", SettingType::Boolean, MDNS_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {UDP_SERVER_PORT, "Udp port", "The UDP port for TCode input", SettingType::Number, UDP_SERVER_PORT_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {WEBSERVER_PORT, "Web port", "The Web port for the web server", SettingType::Number, WEBSERVER_PORT_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {HOST_NAME, "Hostname", "The hostname for network com", SettingType::String, HOST_NAME_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {FRIENDLY_NAME, "Friendly name", "The friendly name displayed when connecting", SettingType::String, FRIENDLY_NAME_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_SSID, "AP Mode SSID", "The SSID for the Ap Mode/AD-HOC connection", SettingType::String, AP_MODE_SSID_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_PASS, "AP Mode password", "The password for the Ap Mode/AD-HOC connection. Leave empty for disabled", SettingType::String, AP_MODE_PASS_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_HIDDEN, "AP Mode hidden", "Does the AP mode broadcase its SSID or not.", SettingType::Boolean, AP_MODE_HIDDEN_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_CHANNEL, "AP Mode channel", "The channel AP mode will work on.", SettingType::Number, AP_MODE_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_IP, "AP Mode IP", "The IP of AP mode.", SettingType::String, AP_MODE_IP_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_SUBNET, "AP Mode subnet", "The subnet of AP mode.", SettingType::String, AP_MODE_SUBNET_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_GATEWAY, "AP Mode gateway", "The Gateway of AP mode.", SettingType::String, AP_MODE_GATEWAY_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}}
            
#if BLUETOOTH_TCODE
            ,{BLUETOOTH_ENABLED, "Bluetooth classic enabled", "Bluetooth classic TCode. Note: this disabled wifi and the website. Use the setting command to switch back", SettingType::Boolean, BLUETOOTH_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Bluetooth, SettingProfile::Wireless}}
#endif             
#if BLE_TCODE
            ,{BLE_ENABLED, "BLE enabled", "BLE TCode. Note: this disabled wifi and the website. Use the setting command to switch back", SettingType::Boolean, BLE_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Ble, SettingProfile::Wireless}},
            {BLE_DEVICE_TYPE, "BLE device type", "BLE device type", SettingType::Number, BLE_DEVICE_TYPE_DEFAULT, RestartRequired::YES, {SettingProfile::Bluetooth, SettingProfile::Wireless}},
            {BLE_LOVE_DEVICE_TYPE, "BLE love device type", "BLE love device type", SettingType::Number, BLE_LOVE_DEVICE_TYPE_DEFAULT, RestartRequired::YES, {SettingProfile::Bluetooth, SettingProfile::Wireless}}    
#endif 
        }
    };

    SettingFileInfo m_commonFileInfo = 
    {
        false, COMMON_SETTINGS_PATH, SettingFile::Common, JsonDocument(), [this]() { loadCommonCache(); }, [this](const char* name) { loadCommonLiveCache(name); },
        {
            {MAX_SERVO_RANGE, "Max servo range", "Max range of the servos", SettingType::Number, MAX_SERVO_RANGE_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {CONTINUOUS_TWIST, "Continous twist", "Ignores any feedback signal from a feedback servo", SettingType::Boolean, CONTINUOUS_TWIST_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {FEEDBACK_TWIST, "Feedback twist", "For feed back servos", SettingType::Boolean, FEEDBACK_TWIST_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {ANALOG_TWIST, "Analog twist", "Analog feedback servo", SettingType::Boolean, ANALOG_TWIST_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}}
#ifdef MOTOR_TYPE_BLDC
            ,{BLDC_TWIST_MULTIPLIER, "BLDC Twist multiplier", "BLDC Twist multiplier", SettingType::Float, BLDC_TWIST_MULTIPLIER_DEFAULT, RestartRequired::NO, {SettingProfile::Bldc}},
            {BLDC_RAILLENGTH, "Rail length", "SSR1 rail length", SettingType::Number, BLDC_RAILLENGTH_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_STROKELENGTH, "Stroke length", "SSR1 stroke length", SettingType::Number, BLDC_STROKELENGTH_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_PID_PROPORTIONAL_CONST, "PID proportional constant", "PID proportional const", SettingType::Float, BLDC_PID_PROPORTIONAL_CONST_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_LOWPASS_FILTER, "Low pass filter", "Low pass filter", SettingType::Float, BLDC_LOWPASS_FILTER_DEFAULT, RestartRequired::NO, {SettingProfile::Bldc}},
            {BLDC_TWIST_LIMIT, "Twist limit", "BLDC twist limit", SettingType::Float, BLDC_TWIST_LIMIT_DEFAULT, RestartRequired::NO, {SettingProfile::Bldc}},

