jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
    SettingFileInfo m_pinsFileInfo = 
    {
        false, PIN_SETTINGS_PATH, SettingFile::Pins, JsonDocument(), [this]() { loadPinCache(); }, [this](const char* name) { loadPinLiveCache(name); },
        {
            // PWM
            {RIGHT_SERVO_PIN, "Right servo PIN", "Pin the right servo is on", SettingType::Number, RIGHT_SERVO_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {RIGHT_SERVO_CHANNEL, "Right servo channel", "Timer channel the right servo is on", SettingType::Number, RIGHT_SERVO_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {LEFT_SERVO_PIN, "Left servo PIN", "Pin the left servo is on", SettingType::Number, LEFT_SERVO_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {LEFT_SERVO_CHANNEL, "Left servo channel", "Timer channel the left servo is on", SettingType::Number, LEFT_SERVO_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {RIGHT_UPPER_SERVO_PIN, "Right upper servo PIN", "Pin the right upper servo is on", SettingType::Number, RIGHT_UPPER_SERVO_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {RIGHT_UPPER_SERVO_CHANNEL, "Right upper servo channel", "Timer channel the right upper servo is on", SettingType::Number, RIGHT_UPPER_SERVO_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {LEFT_UPPER_SERVO_PIN, "Left upper servo PIN", "Pin the left servo is on", SettingType::Number, LEFT_UPPER_SERVO_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {LEFT_UPPER_SERVO_CHANNEL, "Left upper servo channel", "Timer channel the left servo is on", SettingType::Number, LEFT_UPPER_SERVO_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {PITCH_LEFT_SERVO_PIN, "Pitch left servo PIN", "Pin the pitch left servo is on", SettingType::Number, PITCH_LEFT_SERVO_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {PITCH_LEFT_SERVO_CHANNEL, "Pitch left servo channel", "Timer channel the pitch left servo is on", SettingType::Number, PITCH_LEFT_SERVO_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {PITCH_RIGHTSERVO_PIN, "Pitch right servo PIN", "Pin the pitch right servo is on", SettingType::Number, PITCH_RIGHTSERVO_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {PITCH_RIGHTSERVO_CHANNEL, "Pitch right servo channel", "Timer channel the pitch right servo is on", SettingType::Number, PITCH_RIGHTSERVO_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {VALVE_SERVO_PIN, "Valve servo PIN", "Pin the valve servo is on", SettingType::Number, VALVE_SERVO_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {VALVE_SERVO_CHANNEL, "Valve servo channel", "Timer channel the valve servo is on", SettingType::Number, VALVE_SERVO_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {TWIST_SERVO_PIN, "Twist servo PIN", "Pin the twist servo is on", SettingType::Number, TWIST_SERVO_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {TWIST_SERVO_CHANNEL, "Twist servo channel", "Timer channel the twist servo is on", SettingType::Number, TWIST_SERVO_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {SQUEEZE_PIN, "Squeeze servo PIN", "Pin the squeeze servo is on", SettingType::Number, SQUEEZE_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {SQUEEZE_CHANNEL, "Squeeze servo channel", "Timer channel the squeeze servo is on", SettingType::Number, SQUEEZE_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::Servo, SettingProfile::PWM, SettingProfile::Pin}},
            {VIBE0_PIN, "Vibe1 PIN", "Pin the vibe 1 is on", SettingType::Number, VIBE0_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::PWM, SettingProfile::Pin}},
            {VIBE0_CHANNEL, "Vibe1 channel", "Timer channel the vibe 1 is on", SettingType::Number, VIBE0_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::PWM, SettingProfile::Pin}},
            {VIBE1_PIN, "Vibe2 PIN", "Pin the vibe 2 is on", SettingType::Number, VIBE1_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::PWM, SettingProfile::Pin}},
            {VIBE1_CHANNEL, "Vibe2 channel", "Timer channel the vibe 2 is on", SettingType::Number, VIBE1_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::PWM, SettingProfile::Pin}},
            {VIBE2_PIN, "Vibe3 PIN", "Pin the vibe 3 is on", SettingType::Number, VIBE2_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::PWM, SettingProfile::Pin}},
            {VIBE2_CHANNEL, "Vibe3 channel", "Timer channel the vibe 3 is on", SettingType::Number, VIBE2_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::PWM, SettingProfile::Pin}},
            {VIBE3_PIN, "Vibe4 PIN", "Pin the vibe 4 is on", SettingType::Number, VIBE3_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::PWM, SettingProfile::Pin}},
            {VIBE3_CHANNEL, "Vibe4 channel", "Timer channel the vibe 4 is on", SettingType::Number, VIBE3_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::PWM, SettingProfile::Pin}},
            {CASE_FAN_PIN, "Case fan PIN", "Pin the case fan is on", SettingType::Number, CASE_FAN_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::PWM, SettingProfile::Pin}},
            {CASE_FAN_CHANNEL, "Case fan channel", "Timer channel the case fan is on", SettingType::Number, CASE_FAN_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::PWM, SettingProfile::Pin}},
            {HEATER_PIN, "Heater PIN", "Pin the heater is on", SettingType::Number, HEATER_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature, SettingProfile::Pin, SettingProfile::PWM}},
            {HEATER_CHANNEL, "Heater channel", "Timer channel the heater is on", SettingType::Number, HEATER_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature, SettingProfile::Pin, SettingProfile::PWM}},
            // Analog
            {TWIST_FEEDBACK_PIN, "Twist feedback PIN", "The twist feedback pin", SettingType::Number, TWIST_FEEDBACK_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Pin}},
            {LUBE_BUTTON_PIN, "Lube button PIN", "Pin the lube button is on", SettingType::Number, LUBE_BUTTON_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::PWM, SettingProfile::Pin}},
            {INTERNAL_TEMP_PIN, "Internal temp PIN", "Pin the internal temp sensor is on", SettingType::Number, INTERNAL_TEMP_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Analog, SettingProfile::Pin}},
            {DISPLAY_RST_PIN, "Display Rst PIN", "Reset pin for the display", SettingType::Number, DISPLAY_RST_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Display, SettingProfile::Pin}},
            {TEMP_PIN, "Temp pin", "Pin the sleeve temperture is on", SettingType::Number, TEMP_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Pin, SettingProfile::Analog}},
            {I2C_SDA_PIN, "I2C SDA PIN", "Pin of the I2C SDA", SettingType::Number, I2C_SDA_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::System, SettingProfile::Pin}},
            {I2C_SCL_PIN, "I2C SCL PIN", "Pin of the I2C SCL", SettingType::Number, I2C_SCL_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::System, SettingProfile::Pin}},
            {BUTTON_SET_PINS, "Button set pins", "Pins for each button set. (Max 4)", SettingType::ArrayInt, BUTTON_SET_PINS_DEFAULT, RestartRequired::YES, {SettingProfile::Pin, SettingProfile::Analog}},
            // Stroke BLDC
            {BLDC_ENCODER_PIN, "Encoder PIN", "Pin the BLDC encoder is on", SettingType::Number, BLDC_ENCODER_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin}},
            {BLDC_CHIPSELECT_PIN, "Chipselect PIN", "Pin the BLDC chip select is on", SettingType::Number, BLDC_CHIPSELECT_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin}},
            {BLDC_ENABLE_PIN, "Enable PIN", "Pin the BLDC enable is on", SettingType::Number, BLDC_ENABLE_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin}},
            {BLDC_HALLEFFECT_PIN, "Halleffect PIN", "Pin the hall effect is on", SettingType::Number, BLDC_HALLEFFECT_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin}},
            {BLDC_PWMCHANNEL1_PIN, "PWM channel1 PIN", "Pin for the BLDC PWM 1", SettingType::Number, BLDC_PWMCHANNEL1_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin, SettingProfile::PWM}},
            {BLDC_PWMCHANNEL2_PIN, "PWM channel2 PIN", "Pin for the BLDC PWM 2", SettingType::Number, BLDC_PWMCHANNEL2_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin, SettingProfile::PWM}},
            {BLDC_PWMCHANNEL3_PIN, "PWM channel3 PIN", "Pin for the BLDC PWM 3", SettingType::Number, BLDC_PWMCHANNEL3_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin, SettingProfile::PWM}},
            // Twist BLDC
            {BLDC_B_ENCODER_PIN, "Twist Encoder PIN", "Pin the BLDC Twist encoder is on", SettingType::Number, BLDC_B_ENCODER_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin}},
            {BLDC_B_CHIPSELECT_PIN, "Twist Chipselect PIN", "Pin the BLDC Twist chip select is on", SettingType::Number, BLDC_B_CHIPSELECT_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin}},
            {BLDC_B_ENABLE_PIN, "Twist Enable PIN", "Pin the BLDC Twist enable is on", SettingType::Number, BLDC_B_ENABLE_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin}},
            {BLDC_B_PWMCHANNEL1_PIN, "Twist PWM channel1 PIN", "Pin for the Twist BLDC PWM 1", SettingType::Number, BLDC_B_PWMCHANNEL1_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin, SettingProfile::PWM}},
            {BLDC_B_PWMCHANNEL2_PIN, "Twist PWM channel2 PIN", "Pin for the Twist BLDC PWM 2", SettingType::Number, BLDC_B_PWMCHANNEL2_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin, SettingProfile::PWM}},
            {BLDC_B_PWMCHANNEL3_PIN, "Twist PWM channel3 PIN", "Pin for the Twist BLDC PWM 3", SettingType::Number, BLDC_B_PWMCHANNEL3_PIN_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc, SettingProfile::Pin, SettingProfile::PWM}}
            #if CONFIG_IDF_TARGET_ESP32
            ,{ESP_H_TIMER0_FREQUENCY, "High timer 0 frequency", "Frequency for the high timer 0", SettingType::Number, ESP_TIMER_FREQUENCY_DEFAULT, RestartRequired::YES, {SettingProfile::Timer}}
            ,{ESP_H_TIMER1_FREQUENCY, "High timer 1 frequency", "Frequency for the high timer 1", SettingType::Number, ESP_TIMER_FREQUENCY_DEFAULT, RestartRequired::YES, {SettingProfile::Timer}}
            ,{ESP_H_TIMER2_FREQUENCY, "High timer 2 frequency", "Frequency for the high timer 2", SettingType::Number, ESP_TIMER_FREQUENCY_DEFAULT, RestartRequired::YES, {SettingProfile::Timer}}
            ,{ESP_H_TIMER3_FREQUENCY, "High timer 3 frequency", "Frequency for the high timer 3", SettingType::Number, ESP_TIMER_FREQUENCY_DEFAULT, RestartRequired::YES, {SettingProfile::Timer}} 
            #endif
            ,{ESP_L_TIMER0_FREQUENCY, "Low timer 0 frequency", "Frequency for the low timer 0", SettingType::Number, ESP_TIMER_FREQUENCY_DEFAULT, RestartRequired::YES, {SettingProfile::Timer}}
            ,{ESP_L_TIMER1_FREQUENCY, "Low timer 1 frequency", "Frequency for the low timer 1", SettingType::Number, ESP_TIMER_FREQUENCY_DEFAULT, RestartRequired::YES, {SettingProfile::Timer}}
            ,{ESP_L_TIMER2_FREQUENCY, "Low timer 2 frequency", "Frequency for the low timer 2", SettingType::Number, ESP_TIMER_FREQUENCY_DEFAULT, RestartRequired::YES, {SettingProfile::Timer}}
            ,{ESP_L_TIMER3_FREQUENCY, "Low timer 3 frequency", "Frequency for the low timer 3", SettingType::Number, ESP_TIMER_FREQUENCY_DEFAULT, RestartRequired::YES, {SettingProfile::Timer}}  
        }
    };

    SettingFileInfo getDebugInfo() 
    {
        return 
        {
            false, DEBUG_INFO_PATH, SettingFile::DebugInfo, JsonDocument(), 0, 0,
            {
                { DEBUG_INFO_LAST_BOOT_REASONS, "Last boot reasons", "The reasons for boot up or reboot.", SettingType::ArrayString, DEBUG_INFO_LAST_BOOT_REASONS_DEFAULT, RestartRequired::YES, { SettingProfile::System, SettingProfile::Readonly }},
                { DEBUG_INFO_MOTOR_STATE, "Motor State", "The motor state of the last motor init.", SettingType::ArrayString, DEBUG_INFO_MOTOR_STATE_DEFAULT, RestartRequired::YES, { SettingProfile::System, SettingProfile::Readonly }},
            }
        };
    }

    SettingsFactory() { };

    // Cached (Requires reboot)
    TCodeVersion tcodeVersion;
    int udpServerPort;
    int webServerPort;
    char hostname[HOST_NAME_LEN];
    char friendlyName[FRIENDLY_NAME_LEN];
    char apModeSSID[SSID_LEN];
    char apModeIP[IP_ADDRESS_LEN];
    BoardType m_boardType;
    DeviceType m_deviceType;

    // Cached (Live update)
    LogLevel logLevel;
    std::vector<const char*> logIncludes;
    std::vector<const char*> logExcludes;
    bool websocketLoggingEnabled;
    bool inverseStroke;
    bool inversePitch;
    bool inverseTwist;
    bool valveServo90Degrees;
    bool autoValve;
    bool inverseValve;
    bool continuousTwist;
    int lubeAmount;
    int batteryCapacityMax;
    int RightServo_ZERO;
    int LeftServo_ZERO;
    int RightUpperServo_ZERO;
    int LeftUpperServo_ZERO;
    int PitchLeftServo_ZERO;
    int PitchRightServo_ZERO;
    int TwistServo_ZERO;
    int ValveServo_ZERO;
    int SqueezeServo_ZERO;
    char bootButtonCommand[MAX_COMMAND];
    uint16_t buttonAnalogDebounce;
    bool versionDisplayed;
    bool sleeveTempDisplayed;
    bool internalTempDisplayed;
    int Display_Screen_Width;
    int Display_Screen_Height;
    bool batteryLevelNumeric;
    int targetTemp;
    int HeatPWM;
    int HoldPWM;
    float heaterThreshold;
    double internalMaxTemp;
    double internalTempForFanOn;
    bool voiceMuted;
    int8_t voiceVolume;
    int8_t voiceWakeTime;
    int vibTimeout;
    bool vibTimeoutEnabled;
    float m_BLDCTwistMultiplier;
    float m_BLDCTwistLimit;
    float m_BLDCPIDProportionalConst;
    float m_BLDCLowpassFilter;

    // The following cause restart required on boot. Need to figure out how to stop it until all has been loaded.
    void checkRestartRequired(SettingFileInfo* fileInfo, const char* settingName)
    {
        // if(!m_restartRequired && m_initialized)
        // {
        //     const Setting* setting = fileInfo->getSetting(settingName);
        //     checkRestartRequired(setting, settingName);
        // }
    }

