jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
    void checkRestartRequired(const Setting* setting, const char* settingName)
    {
        // if(setting && m_initialized && !m_restartRequired )
        // {
        //     m_restartRequired = setting->isRestartRequired == RestartRequired::YES;
        // }
    }

    bool load(SettingFileInfo &fileInfo)
    {
        LogHandler::debug(m_TAG, "Loading file: %s", fileInfo.path);
        File file;
        if(!openFile(fileInfo, file))
        {
            if(!createJsonFile(fileInfo.path))
                return false;
            if(!loadDefault(fileInfo.file))
                return false;
        } else {
            DeserializationError::Code code;
            if(LogHandler::logDeserializationError(m_TAG, deserializeJson(fileInfo.doc, file), file.name(), code)) 
            {
                file.close();
                return false;
                // I decided against auto resetting defaults.
                // Need a way to allow the user to choose to set defaults or not.
                // if(code == DeserializationError::Code::EmptyInput)
                // {
                //     // Force a default file
                //     // Sometimes the file gets emptied out. Wish I knew how...
                //     LogHandler::error(m_TAG, "Sometimes the file gets emptied out. Setting %s to default. Sorry.", fileInfo.path);
                //     if(!createJsonFile(fileInfo.path))
                //         return false;
                //     if(!loadDefault(fileInfo.file))
                //         return false;
                // }
                
            }
            // if(fileInfo.doc.isNull())
            // {
            //     LogHandler::info(m_TAG, "File %s is null. Loading default.", fileInfo.path);
            //     if(!loadDefault(fileInfo.file))
            //         return false;
            // }
            file.close();
            // checkFile(fileInfo);
        }
        fileInfo.initialized = true;
        if(fileInfo.onload)
            fileInfo.onload();
        //json = doc.as<JsonObject>();
        return true;
    }

    bool openFile(SettingFileInfo &fileInfo, File& file)
    {
        LogHandler::info(m_TAG, "Loading file: %s", fileInfo.path);
        bool fileExists = LittleFS.exists(fileInfo.path);
        if(!fileExists)
        {
            LogHandler::info(m_TAG, "File %s did not exist", fileInfo.path);
            return false;
        } else {
            file = LittleFS.open(fileInfo.path, FILE_READ, !fileExists);
            if(!file) {
                LogHandler::error(m_TAG, "%s failed to open!", fileInfo.path);
                return false;
            }
        }
        return true;
    }
    
    // bool loadVector(SettingFileInfo &fileInfo, std::vector<const char*> vector)
    // {
    //     for (size_t i = 0; i < fileInfo.settings.size(); i++)
    //     {
    //         Setting setting = fileInfo.settings[i];
    //         if(setting.type == SettingType::ArrayString) 
    //         {
    //             JsonArray array = fileInfo.doc[setting.name];
    //             for (size_t j = 0; j < array.size(); j++)
    //             {
    //                 vector.push_back(array[j].as<const char*>());
    //             }
                
    //         } 
    //     }
        
    //     return true;
    // }

    bool loadDefault(SettingFile file) 
    {
        if(file == SettingFile::System) 
        {
            return loadDefault(m_systemFileInfo);
        }
        else if(file == SettingFile::Network) 
        {
            return loadDefault(m_networkFileInfo);
        }
        else if(file == SettingFile::Common) 
        {
            return loadDefault(m_commonFileInfo);
        }
        else if(file == SettingFile::Pins) 
        {
            return loadDefaultPins();
        }
        else if(file == SettingFile::DebugInfo) 
        {
            SettingFileInfo debugInfo = getDebugInfo();
            return loadDefault(debugInfo);
            
        }
        LogHandler::error(m_TAG, "Unknown file loading default: %ld", (int)file);
        return false;
    }

    //template <unsigned int N>
    bool loadDefault(SettingFileInfo &fileInfo)
    {
        LogHandler::info(m_TAG, "Loading default: %s", fileInfo.path);
        for(const Setting& setting : fileInfo.settings)
        {
            defaultToJson(&setting, fileInfo.doc);
        }
        fileInfo.initialized = true;
        return saveToDisk(fileInfo);
    }
    /// @brief checkFile checks a file for all keys in settings to exist
    /// @param fileInfo 
    /// @return true if file was missing a key
    bool checkFile(SettingFileInfo &fileInfo)
    {
        LogHandler::debug(m_TAG, "Checking file: %s", fileInfo.path);
        bool fileChanged = false;
        for(const Setting& setting : fileInfo.settings)
        {
            //if(!fileInfo.doc.containsKey(setting.name)) 
            if(fileInfo.doc[setting.name].isNull()) 
            {
                fileChanged = true;
                LogHandler::error(m_TAG, "File key '%s' missing. Loading default.", setting.name);
                defaultToJson(&setting, fileInfo.doc);
            }
        }
        if(fileChanged)
            saveToDisk(fileInfo);
        return fileChanged;
    }

    bool loadDefaultVector(const Setting *setting, JsonDocument &doc) {
        
        if(!strcmp(setting->name, LOG_INCLUDETAGS)) {
            std::vector<const char*> includesVec;
            doc[LOG_INCLUDETAGS] = includesVec;
            loadSystemLiveCache(LOG_INCLUDETAGS);
            return true;
        } else if(!strcmp(setting->name, LOG_EXCLUDETAGS)) {
            std::vector<const char*> excludesVec;
            doc[LOG_EXCLUDETAGS] = excludesVec;
            loadSystemLiveCache(LOG_EXCLUDETAGS);
            return true;
        } else if(!strcmp(setting->name, BUTTON_SET_PINS)) {
            std::vector<int8_t> vec = { BUTTON_SET_PINS_1, BUTTON_SET_PINS_2, BUTTON_SET_PINS_3, BUTTON_SET_PINS_4 };
            doc[BUTTON_SET_PINS] = vec;
            return true;
        } else if(!strcmp(setting->name, DEBUG_INFO_LAST_BOOT_REASONS)) {
            std::vector<const char*> vec = { };
            doc[DEBUG_INFO_LAST_BOOT_REASONS] = vec;
            return true;
        }
        LogHandler::error(m_TAG, "No default vector set for: %s", setting->name);
        return false;
    }

