jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
    bool loadDefaultPins() {
        BoardType boardType;
        getValue(BOARD_TYPE_SETTING, boardType);// Use setting from json
        switch(boardType)
        {
            case BoardType::CRIMZZON: {
                PinMapSR6MB* pinMap = PinMapSR6MB::getInstance();
                pinMap->overideDefaults();
                m_pinsFileInfo.initialized = true;
                syncSR6AndCommonPinsToDisk(pinMap);
                loadDefaultChannelsForDeviceType();
                return saveToDisk(m_pinsFileInfo);
            }
            break;
            case BoardType::ISAAC: {
                PinMapINControl* pinMap = PinMapINControl::getInstance();
                pinMap->overideDefaults();
                m_pinsFileInfo.initialized = true;
                syncSR6AndCommonPinsToDisk(pinMap);
                loadDefaultChannelsForDeviceType();
                return saveToDisk(m_pinsFileInfo);
            }
            break;
            case BoardType::SSR1PCB: {
                PinMapSSR1PCB* pinMap = PinMapSSR1PCB::getInstance();
                pinMap->overideDefaults();
                m_pinsFileInfo.initialized = true;
                syncSSRAndCommonPinsToDisk(pinMap);
                loadDefaultChannelsForDeviceType();
                return saveToDisk(m_pinsFileInfo);
            }
            break;
            default: {
                bool ret = loadDefault(m_pinsFileInfo);
                m_pinsFileInfo.initialized = true;
                loadDefaultChannelsForDeviceType();
                return saveToDisk(m_pinsFileInfo);
            }
        }
    }

    void loadDefaultChannelsForDeviceType() {
        DeviceType deviceType;
        getValue(DEVICE_TYPE, deviceType);
        switch(deviceType) {
            case DeviceType::OSR: {
                LogHandler::debug(m_TAG, "Loading default channels and pins for OSR");
#if CONFIG_IDF_TARGET_ESP32
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH0_CH0);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH0_CH1);
                setValue(RIGHT_UPPER_SERVO_PIN, -1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_UPPER_SERVO_PIN, -1);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH1_CH2);
                setValue(PITCH_RIGHTSERVO_PIN, -1);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH1_CH3);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH2_CH4);
                setValue(SQUEEZE_PIN, -1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(ESP_L_TIMER0_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(ESP_L_TIMER1_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH4);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH6);
#elif CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32E22
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_UPPER_SERVO_PIN, -1);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(PITCH_RIGHTSERVO_PIN, -1);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH5);
                setValue(SQUEEZE_PIN, -1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE0_PIN, -1);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE1_PIN, -1);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE2_PIN, -1);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE3_PIN, -1);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(CASE_FAN_PIN, -1);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(HEATER_PIN, -1);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
#endif
                break;
            }
            case DeviceType::SR6: {
                LogHandler::debug(m_TAG, "Loading default channels and pins for SR6");
#if CONFIG_IDF_TARGET_ESP32
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH0_CH0);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH0_CH1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH1_CH2);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH1_CH3);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH2_CH4);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH2_CH5);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH3_CH6);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH3_CH7);
                setValue(SQUEEZE_PIN, -1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(ESP_L_TIMER0_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(ESP_L_TIMER1_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH4);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH6);
#elif CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32E22
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH4);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH5);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH6);
                setValue(VALVE_SERVO_PIN, -1);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(SQUEEZE_PIN, -1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE0_PIN, -1);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE1_PIN, -1);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE2_PIN, -1);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE3_PIN, -1);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH7);
                setValue(HEATER_PIN, -1);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
#endif
                break;
            }
            case DeviceType::SSR1:
            case DeviceType::SSR2: {
                LogHandler::debug(m_TAG, "Loading default channels and pins for SSR1");
#if CONFIG_IDF_TARGET_ESP32
                setValue(RIGHT_SERVO_PIN, -1);
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_SERVO_PIN, -1);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(RIGHT_UPPER_SERVO_PIN, -1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_UPPER_SERVO_PIN, -1);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_LEFT_SERVO_PIN, -1);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH0_CH0);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH2_CH4);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH0_CH1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH1_CH2);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(ESP_L_TIMER0_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(ESP_L_TIMER1_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH4);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH6);
#elif CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32E22
                setValue(RIGHT_SERVO_PIN, -1);
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_SERVO_PIN, -1);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(RIGHT_UPPER_SERVO_PIN, -1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_UPPER_SERVO_PIN, -1);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_LEFT_SERVO_PIN, -1);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(VALVE_SERVO_PIN, -1);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(SQUEEZE_PIN, -1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH4);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH5);
                setValue(ESP_L_TIMER1_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(ESP_L_TIMER2_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH6);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH7);
#endif
                break;
            }
            case DeviceType::TVIBE: {
                LogHandler::debug(m_TAG, "Loading default channels and pins for TVIBE");
                setValue(RIGHT_SERVO_PIN, -1);
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_SERVO_PIN, -1);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(RIGHT_UPPER_SERVO_PIN, -1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_UPPER_SERVO_PIN, -1);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_LEFT_SERVO_PIN, -1);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(TWIST_SERVO_PIN, -1);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VALVE_SERVO_PIN, -1);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_RIGHTSERVO_PIN, -1);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(SQUEEZE_PIN, -1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(ESP_L_TIMER0_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(ESP_L_TIMER1_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH4);
                setValue(HEATER_PIN, -1);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
            }
        }
    }
            
    bool loadAllFromDisk()
    {
        for(SettingFileInfo* settingsInfo : AllSettings)
        {
            if(!load(*settingsInfo))
                return false;
        }
        return true;
    }

    bool loadSystemFromDisk()
    {
        m_systemFileInfo.take();
        auto ret = load(m_systemFileInfo);
        m_systemFileInfo.give();
        return ret;
    }

    bool loadCommonFromDisk()
    {
        m_commonFileInfo.take();
        auto ret = load(m_commonFileInfo);
        m_commonFileInfo.give();
        return ret;
    }
    bool loadNetworkFromDisk()
    {
        m_networkFileInfo.take();
        bool ret = load(m_networkFileInfo);;
        m_networkFileInfo.give();
        return ret;
    }
    bool loadPinsFromDisk()
    {
        m_pinsFileInfo.take();
        bool ret = load(m_pinsFileInfo);
        m_pinsFileInfo.give();
        return ret;
    }

    //template <unsigned int N>
    bool saveToDisk(SettingFileInfo &fileInfo, JsonObject fromJson = JsonObject())
    {
        LogHandler::debug(m_TAG, "Save file: %s", fileInfo.path);
        if(!fromJson.isNull()) {
            LogHandler::debug(m_TAG, "Saving from override json");
            fileInfo.doc.clear();
            fileInfo.doc.set(fromJson);
        }

        LogHandler::debug(m_TAG, "Doc overflowed: %u", fileInfo.doc.overflowed());
        //LogHandler::debug(m_TAG, "Doc memory: %u", fileInfo.doc.memoryUsage());
        //LogHandler::debug(m_TAG, "Doc capacity: %u", fileInfo.doc.capacity());
        File file = LittleFS.open(fileInfo.path, FILE_WRITE);
        if (!file )
        {
            LogHandler::error(m_TAG, "Failed to open file: %s", fileInfo.path);
            return false;
        }
        if (!serializeJson(fileInfo.doc, file))
        {
            LogHandler::error(m_TAG, "Failed to write to file: %s", fileInfo.path);
            file.close();
            return false;
        }
        if(LogHandler::getLogLevel() >= LogLevel::DEBUG)
            LogHandler::debug(m_TAG, "File contents: %s", file.readString().c_str());
        file.close();
        if(fileInfo.onchange)
            fileInfo.onchange(0);
        LogHandler::info(m_TAG, "This is a test log.\tIts going to be a long one. Hopefully greater than 256 (MAX_COMMAND) bytes. Can I do it? Ramble on about how long this message is without running out of steam? Have I hit 256 bytes yet? Nope, My hands are gettinf tired. Whoops a typo. Im not going to fix it because who cares? Not the point. Oh, I hit 256 a while agio. Ok I suppose I need 512 chars now. Thts DOUBLE the max len. Getting close I can feel it. I'm lying, I can see it in my text editor. Oh my, I dont have anything left to say. YES done!");
        return true;
    }

    void loadSystemCache() 
    {
        LogHandler::debug(m_TAG, "SettingsFactory::loadSystemCache");
        if(!m_systemFileInfo.initialized) {
            LogHandler::error(m_TAG, "loadSystemCache called before initialized");
            return;
        }
	    getValue(TCODE_VERSION_SETTING, tcodeVersion);
        loadSystemLiveCache();
    }

    void loadNetworkCache() 
    {
        LogHandler::debug(m_TAG, "SettingsFactory::loadNetworkCache");
        if(!m_networkFileInfo.initialized) {
            LogHandler::error(m_TAG, "loadNetworkCache called before initialized");
            return;
        }
	    getValue(UDP_SERVER_PORT, udpServerPort);
	    getValue(WEBSERVER_PORT, webServerPort);
	    getValue(HOST_NAME, hostname, HOST_NAME_LEN);
	    getValue(FRIENDLY_NAME, friendlyName, FRIENDLY_NAME_LEN);
        getValue(AP_MODE_SSID, apModeSSID, SSID_LEN);
        getValue(AP_MODE_IP, apModeIP, IP_ADDRESS_LEN);
        loadNetworkLiveCache();
    }

    void loadCommonCache() 
    {
        LogHandler::debug(m_TAG, "SettingsFactory::loadCommonCache");
        if(!m_commonFileInfo.initialized) {
            LogHandler::error(m_TAG, "loadCommonCache called before initialized");
            return;
        }
        getValue(DEVICE_TYPE, m_deviceType);
        getValue(BOARD_TYPE_SETTING, m_boardType);
        loadCommonLiveCache();
    }

