jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
    void loadPinCache() {
        LogHandler::debug(m_TAG, "SettingsFactory::loadPinCache");
        if(!m_pinsFileInfo.initialized) {
            LogHandler::error(m_TAG, "loadPinCache called before initialized");
            return;
        }
        DeviceType deviceType;
        getValue(DEVICE_TYPE, deviceType);
        switch(deviceType) 
        {
            case DeviceType::SSR1:
            case DeviceType::SSR2:
                m_currentPinMap = loadSSRPins();
            break;
            case DeviceType::SR6:
                m_currentPinMap = loadSR6Pins();
            break;
            case DeviceType::OSR:
                m_currentPinMap = loadOSRPins();
            break;
            default:
                #ifdef MOTOR_TYPE_BLDC
                    m_currentPinMap = loadSSRPins();
                #elif defined MOTOR_TYPE_SERVO
                    m_currentPinMap = loadOSRPins();
                #endif

        }
    }

    void loadCommonPins(PinMap* pinMap) 
    {
        LogHandler::debug(m_TAG, "SettingsFactory::loadCommonPins");
        if(!m_pinsFileInfo.initialized) {
            LogHandler::error(m_TAG, "loadCommonPins called before initialized");
            return;
        }
        int8_t pin = -1;
        int8_t channel = -1;
        getValue(VALVE_SERVO_PIN, pin);
        pinMap->setValve(pin);
        getValue(VALVE_SERVO_CHANNEL, channel);
        pinMap->setValveChannel(channel);
        getValue(TWIST_SERVO_PIN, pin);
        pinMap->setTwist(pin);
        getValue(TWIST_SERVO_CHANNEL, channel);
        pinMap->setTwistChannel(channel);
        getValue(SQUEEZE_PIN, pin);
        pinMap->setSqueeze(pin);
        getValue(SQUEEZE_CHANNEL, channel);
        pinMap->setSqueezeChannel(channel);
        getValue(VIBE0_PIN, pin);
        pinMap->setVibe0(pin);
        getValue(VIBE0_CHANNEL, channel);
        pinMap->setVibe0Channel(channel);
        getValue(VIBE1_PIN, pin);
        pinMap->setVibe1(pin);
        getValue(VIBE1_CHANNEL, channel);
        pinMap->setVibe1Channel(channel);
        getValue(VIBE2_PIN, pin);
        pinMap->setVibe2(pin);
        getValue(VIBE2_CHANNEL, channel);
        pinMap->setVibe2Channel(channel);
        getValue(VIBE3_PIN, pin);
        pinMap->setVibe3(pin);
        getValue(VIBE3_CHANNEL, channel);
        pinMap->setVibe3Channel(channel);
        getValue(CASE_FAN_PIN, pin);
        pinMap->setCaseFan(pin);
        getValue(CASE_FAN_CHANNEL, channel);
        pinMap->setCaseFanChannel(channel);
        getValue(HEATER_PIN, pin);
        pinMap->setHeater(pin);
        getValue(HEATER_CHANNEL, channel);
        pinMap->setHeaterChannel(channel);

        getValue(TWIST_FEEDBACK_PIN, pin);
        pinMap->setTwistFeedBack(pin);
        getValue(LUBE_BUTTON_PIN, pin);
        pinMap->setLubeButton(pin);
        getValue(INTERNAL_TEMP_PIN, pin);
        pinMap->setInternalTemp(pin);
        getValue(DISPLAY_RST_PIN, pin);
        pinMap->setDisplayReset(pin);
        getValue(TEMP_PIN, pin);
        pinMap->setSleeveTemp(pin);
        getValue(I2C_SDA_PIN, pin);
        pinMap->setI2cSda(pin);
        getValue(I2C_SCL_PIN, pin);
        pinMap->setI2cScl(pin);
        std::vector<int> vec;
        getValueVector(BUTTON_SET_PINS, vec);
        for (size_t i = 0; i < vec.size(); i++)
        {
            pinMap->setButtonSetPin(vec[i], i);
        }

        int timerFreq = -1;
#if CONFIG_IDF_TARGET_ESP32
        getValue(ESP_H_TIMER0_FREQUENCY, timerFreq);
        pinMap->setTimerFrequency(0, timerFreq);
        getValue(ESP_H_TIMER1_FREQUENCY, timerFreq);
        pinMap->setTimerFrequency(1, timerFreq);
        getValue(ESP_H_TIMER2_FREQUENCY, timerFreq);
        pinMap->setTimerFrequency(2, timerFreq);
        getValue(ESP_H_TIMER3_FREQUENCY, timerFreq);
        pinMap->setTimerFrequency(3, timerFreq);
        getValue(ESP_L_TIMER0_FREQUENCY, timerFreq);
        pinMap->setTimerFrequency(4, timerFreq);
        getValue(ESP_L_TIMER1_FREQUENCY, timerFreq);
        pinMap->setTimerFrequency(5, timerFreq);
        getValue(ESP_L_TIMER2_FREQUENCY, timerFreq);
        pinMap->setTimerFrequency(6, timerFreq);
        getValue(ESP_L_TIMER3_FREQUENCY, timerFreq);
        pinMap->setTimerFrequency(7, timerFreq);
//#elif CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32E22
#else
        getValue(ESP_L_TIMER0_FREQUENCY, timerFreq);
        pinMap->setTimerFrequency(0, timerFreq);
        getValue(ESP_L_TIMER1_FREQUENCY, timerFreq);
        pinMap->setTimerFrequency(1, timerFreq);
        getValue(ESP_L_TIMER2_FREQUENCY, timerFreq);
        pinMap->setTimerFrequency(2, timerFreq);
        getValue(ESP_L_TIMER3_FREQUENCY, timerFreq);
        pinMap->setTimerFrequency(3, timerFreq);
#endif
    }

    PinMapSSR* loadSSRPins() 
    {
        LogHandler::debug(m_TAG, "SettingsFactory::loadSSRPins");
        if(!m_pinsFileInfo.initialized) {
            LogHandler::error(m_TAG, "loadSSR1Pins called before initialized");
            return 0;
        }
        PinMapSSR* pinMap = PinMapSSR::getInstance();
        loadCommonPins(pinMap);
        int8_t pin = -1;
        getValue(BLDC_ENCODER_PIN, pin);
        pinMap->setEncoder(pin);
        getValue(BLDC_CHIPSELECT_PIN, pin);
        pinMap->setChipSelect(pin);
        getValue(BLDC_ENABLE_PIN, pin);
        pinMap->setEnable(pin);
        getValue(BLDC_HALLEFFECT_PIN, pin);
        pinMap->setHallEffect(pin);
        getValue(BLDC_PWMCHANNEL1_PIN, pin);
        pinMap->setPwmChannel1(pin);
        getValue(BLDC_PWMCHANNEL2_PIN, pin);
        pinMap->setPwmChannel2(pin);
        getValue(BLDC_PWMCHANNEL3_PIN, pin);
        pinMap->setPwmChannel3(pin);

        getValue(BLDC_B_ENCODER_PIN, pin);
        pinMap->setLeftEncoder(pin);
        getValue(BLDC_B_CHIPSELECT_PIN, pin);
        pinMap->setLeftChipSelect(pin);
        getValue(BLDC_B_ENABLE_PIN, pin);
        pinMap->setLeftEnable(pin);
        getValue(BLDC_B_PWMCHANNEL1_PIN, pin);
        pinMap->setLeftPwmChannel1(pin);
        getValue(BLDC_B_PWMCHANNEL2_PIN, pin);
        pinMap->setLeftPwmChannel2(pin);
        getValue(BLDC_B_PWMCHANNEL3_PIN, pin);
        pinMap->setLeftPwmChannel3(pin);
        return pinMap;

